app/controllers/gigs_controller.rb

  def index
    @gigs = Gig.all
---
SELECT "gigs".* FROM "gigs"

  def show
    @gig = Gig.find(params[:id])
---
SELECT "gigs".* FROM "gigs" WHERE "gigs"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @gig = Gig.new(params[:gig])

    respond_to do |format|
      if @gig.save
---
INSERT INTO "gigs" ("cat1", "cat2", "created_at", "email", "end", "external_url", "lat", "lng", "name", "notes", "pricehigher", "pricelower", "promoted", "start", "ticket_url", "updated_at", "user_id", "user_is_going") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @gig = Gig.find(params[:id])

    respond_to do |format|
      if @gig.update_attributes(params[:gig])
---
SELECT "gigs".* FROM "gigs" WHERE "gigs"."id" = ? LIMIT 1  [["id", "11"]]
UPDATE "gigs" SET "name" = 'Dobson', "updated_at" = '2013-06-20 17:32:11.018699' WHERE "gigs"."id" = 3

  def destroy
    @gig = Gig.find(params[:id])
    @gig.destroy
---
SELECT "gigs".* FROM "gigs" WHERE "gigs"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "gigs" WHERE "gigs"."id" = ?  [["id", 4]]