app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (email = 's_morgan@me.com')
SELECT 1 AS one FROM "users" WHERE "users"."email" = 's_morgan@me.com' LIMIT 1
---
	def check_for
		cruiser = User.where("email = ?", params[:email] + '.com')
		if User.exists?(:email => params[:email] + '.com')